fonecmid-diplom/src/Documents/ВКМ_ОбслуживаниеКлиентов/ВКМ_ОбслуживаниеКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ОбслуживаниеКлиентов</name>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеСотрудникомРаботыРег</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеКлиентуРаботыРег</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Специалист</name>
    <type>
      <types>CatalogRef.ВКМ_ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроведенияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачалаРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОкончанияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПроблемы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.ВКМ_СтатусыЗаявокНаОбслуживание</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВыполненныеРаботы</name>
    <attributes>
      <name>ОписаниеРабот</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФактическиПотраченоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧасыКОплатеКлиенту</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВыполненныеКлиентуРаботыРег/ВКМ_ВыполненныеКлиентуРаботыРег.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеКлиентуРаботыРег</name>
  <resources>
    <name>КоличествоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/InformationRegisters/ВКМ_УсловияОплатыСотрудниковРег/ВКМ_УсловияОплатыСотрудниковРег.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_УсловияОплатыСотрудниковРег</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Оклад</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентОтРабот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВыполненныеСотрудникомРаботыРег/ВКМ_ВыполненныеСотрудникомРаботыРег.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеСотрудникомРаботыРег</name>
  <resources>
    <name>ЧасовКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/Enums/ВКМ_СтатусыЗаявокНаОбслуживание/ВКМ_СтатусыЗаявокНаОбслуживание.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВКМ_СтатусыЗаявокНаОбслуживание</name>
  <enumValues>
    <name>НазначенОтветственному</name>
  </enumValues>
  <enumValues>
    <name>Открыт</name>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
  <enumValues>
    <name>ВнесеныКорректировки</name>
  </enumValues>
  <enumValues>
    <name>Выполнен</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Enums/ВКМ_КлассификацияСотрудников/ВКМ_КлассификацияСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВКМ_КлассификацияСотрудников</name>
  <enumValues>
    <name>Специалист</name>
  </enumValues>
  <enumValues>
    <name>АдминистративныйПерсонал</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_НачалоДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ОкончаниеДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_АбонентскаяПлата</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom/src/Documents/ВКМ_ОбслуживаниеКлиентов/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если Проведен И Статус = ПредопределенноеЗначение("Перечисление.ВКМ_СтатусыЗаявокНаОбслуживание.Открыт") Тогда
			
			Записать(РежимЗаписиДокумента.ОтменаПроведения);		

	ИначеЕсли Статус = ПредопределенноеЗначение("Перечисление.ВКМ_СтатусыЗаявокНаОбслуживание.Выполнен") Тогда

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентов.ВКМ_НачалоДействияДоговора КАК НачалоДействияДоговора,
		|	ДоговорыКонтрагентов.ВКМ_ОкончаниеДействияДоговора КАК ОкончаниеДействияДоговора,
		|	ДоговорыКонтрагентов.ВКМ_СтоимостьЧасаРаботы КАК СтоимостьЧасаРаботы,
		|	ДоговорыКонтрагентов.ВКМ_АбонентскаяПлата КАК АбонентскаяПлата,
		|	ВКМ_ОбслуживаниеКлиентов.Клиент КАК Клиент,
		|	ВКМ_ОбслуживаниеКлиентов.Договор КАК Договор,
		|	ДоговорыКонтрагентов.Наименование КАК НаименованиеДоговора,
		|	ВКМ_ОбслуживаниеКлиентов.Дата КАК ДатаДокумента,
		|	ДоговорыКонтрагентов.ВидДоговора КАК ВидДоговора,
		|	СУММА(ВКМ_ОбслуживаниеКлиентовВыполненныеРаботы.ФактическиПотраченоЧасов) КАК ФактическиПотраченоЧасов,
		|	СУММА(ВКМ_ОбслуживаниеКлиентовВыполненныеРаботы.ЧасыКОплатеКлиенту) КАК ЧасыКОплатеКлиенту
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиентов.ВыполненныеРаботы КАК ВКМ_ОбслуживаниеКлиентовВыполненныеРаботы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВКМ_ОбслуживаниеКлиентов КАК ВКМ_ОбслуживаниеКлиентов
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|			ПО ВКМ_ОбслуживаниеКлиентов.Договор = ДоговорыКонтрагентов.Ссылка
		|		ПО ВКМ_ОбслуживаниеКлиентовВыполненныеРаботы.Ссылка = ВКМ_ОбслуживаниеКлиентов.Ссылка
		|ГДЕ
		|	ВКМ_ОбслуживаниеКлиентов.Ссылка = &Ссылка
		|	И ДоговорыКонтрагентов.Владелец = ВКМ_ОбслуживаниеКлиентов.Клиент
		|СГРУППИРОВАТЬ ПО
		|	ДоговорыКонтрагентов.ВидДоговора,
		|	ДоговорыКонтрагентов.ВКМ_НачалоДействияДоговора,
		|	ДоговорыКонтрагентов.ВКМ_ОкончаниеДействияДоговора,
		|	ДоговорыКонтрагентов.ВКМ_СтоимостьЧасаРаботы,
		|	ДоговорыКонтрагентов.ВКМ_АбонентскаяПлата,
		|	ВКМ_ОбслуживаниеКлиентов.Клиент,
		|	ВКМ_ОбслуживаниеКлиентов.Договор,
		|	ДоговорыКонтрагентов.Наименование,
		|	ВКМ_ОбслуживаниеКлиентов.Дата";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка );
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выгрузить();
	
	Для Каждого ДоговорЗапрос Из Выборка Цикл
		
Если ДоговорЗапрос.ВидДоговора <> ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда
	
	ВидНеобходимогоДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание");	
	Сообщение = Новый СообщениеПользователю();
	Сообщение.Текст = СтрШаблон("Договор ""%1"" не является необходимым видом договора. 
	|Выберите договор с видом ""%2"" и повторите проведение.", ДоговорЗапрос.НаименованиеДоговора, ВидНеобходимогоДоговора);
	Сообщение.Сообщить();
	Отказ = Истина;
	
КонецЕсли;

Если ДоговорЗапрос.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда

Если ДоговорЗапрос.ДатаДокумента >= ДоговорЗапрос.НачалоДействияДоговора И ДоговорЗапрос.ДатаДокумента <= ДоговорЗапрос.ОкончаниеДействияДоговора Тогда	

	// регистр ВКМ_ВыполненныеКлиентуРаботы
	Движения.ВКМ_ВыполненныеКлиентуРаботыРег.Записывать = Истина;
	
	Движение = Движения.ВКМ_ВыполненныеКлиентуРаботыРег.Добавить();
	Движение.Период = Дата;
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Клиент = Клиент;
	Движение.Договор = Договор;
	Движение.КоличествоЧасов = ДоговорЗапрос.ЧасыКОплатеКлиенту;
	Движение.СуммаКОплате = ДоговорЗапрос.СтоимостьЧасаРаботы * Движение.КоличествоЧасов;
	
	
Иначе
	
	Сообщение = Новый СообщениеПользователю();
	Сообщение.Текст = СтрШаблон("Дата документа ""%1"" не входит в период действия договора С ""%2"" По ""%3"". 
	|Выберите договор с подходящей датой действия и повторите проведение.",ДоговорЗапрос.ДатаДокумента, ДоговорЗапрос.НачалоДействияДоговора, ДоговорЗапрос.ОкончаниеДействияДоговора);

	Сообщение.Сообщить();
	Отказ = Истина;
	
КонецЕсли;

КонецЕсли;
	
КонецЦикла;	


	// запись в регистр ВКМ_ВыполненныеСотрудникомРаботыРег
	
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_УсловияОплатыСотрудниковРег.ПроцентОтРабот КАК ПроцентОтРабот,
		|	ВКМ_УсловияОплатыСотрудниковРег.Сотрудник.КатегорияСотрудника КАК КатегорияСотрудника
		|ИЗ
		|	РегистрСведений.ВКМ_УсловияОплатыСотрудниковРег КАК ВКМ_УсловияОплатыСотрудниковРег
		|ГДЕ
		|	ВКМ_УсловияОплатыСотрудниковРег.Сотрудник = &Сотрудник";
	
	Запрос.УстановитьПараметр("Сотрудник", Специалист);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выгрузить();
	
	Для Каждого Сотрудник Из ВыборкаДетальныеЗаписи Цикл
	
	Если Сотрудник.ПроцентОтРабот = Неопределено Тогда
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = СтрШаблон("Для сотрудника %1 не установлен процент оплаты от работ", Специалист);
		Сообщение.Сообщить();
		
		Отказ = Истина;
		
//	ИначеЕсли Сотрудник.ПроцентОтРабот <> 0 Тогда
	Иначе
			
	ПроцентОтРабот = Сотрудник.ПроцентОтРабот;
	
	Движения.ВКМ_ВыполненныеСотрудникомРаботыРег.Записывать = Истина;
	
	ДвижениеПоСотрудникам = Движения.ВКМ_ВыполненныеСотрудникомРаботыРег.Добавить();
	ДвижениеПоСотрудникам.Период = Дата;
	ДвижениеПоСотрудникам.ВидДвижения = ВидДвиженияНакопления.Приход;
	ДвижениеПоСотрудникам.Сотрудник = Специалист;
	ДвижениеПоСотрудникам.ЧасовКОплате = (ВремяОкончанияРабот - ВремяНачалаРабот) / 3600;
	
		Если Сотрудник.КатегорияСотрудника = ПредопределенноеЗначение("Перечисление.ВКМ_КлассификацияСотрудников.Специалист") И Сотрудник.ПроцентОтРабот <> 0 Тогда
	
		ДвижениеПоСотрудникам.СуммаКОплате = (Договор.ВКМ_СтоимостьЧасаРаботы * ДвижениеПоСотрудникам.ЧасовКОплате * ПроцентОтРабот) / 100;
	
		ИначеЕсли Не Сотрудник.КатегорияСотрудника = ПредопределенноеЗначение("Перечисление.ВКМ_КлассификацияСотрудников.Специалист") ИЛИ Сотрудник.ПроцентОтРабот = 0 Тогда
	
		ДвижениеПоСотрудникам.СуммаКОплате = 0;
		
		КонецЕсли;
		
	КонецЕсли;
	
	КонецЦикла;
	
	Статус = ПредопределенноеЗначение("Перечисление.ВКМ_СтатусыЗаявокНаОбслуживание.Закрыт");
	Записать(РежимЗаписиДокумента.Запись);
	
	Иначе
		
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Проведение документа возможно только при статусе докумена ""Выполнен""";
		Сообщение.Сообщить();
	
	КонецЕсли;
	
	

КонецПроцедуры

#КонецОбласти
